<template>
  <div>
    <!--支撑头部空白部分-->
    <div class="top-header"></div>
    <div class="content">
      <h3>网站使用条款</h3>
      <img src="../../assets/images/clause/wzsytk.jpg" />
      <section class="text">
        <p class="p1">欢迎并感谢您浏览、使用本公司的网站（网址：http://www.lapador.com.cn/，以下简称“本网站”）。当您浏览、使用本网站时，即表示您已知晓并接受本《网站使用条款》（以下简称“本条款”）以及相关法律的约束。如果您不同意，请勿继续浏览、使用或登录本网站。</p>
        <article
          class="duan"
          v-for="(item,index) in content"
          :key="index"
        >
          <p class="title">{{item.title}}</p>
          <p
            class="con"
            v-for="(item,index) of item.p1"
            :key="index"
          >{{item}}</p>
        </article>
        <p class="p2">啦普哆母婴用品（上海）有限公司 </p>
        <p class="p3">电子邮件：lapador@lapador.com.cn</p>
      </section>
    </div>
    <Footer></Footer>
  </div>
</template>

<script>
import Footer from "@/components/commons/footer/footer.vue";

export default {
  data() {
    return {
      content: [
        {
          title: "1、 适用范围",
          p1: [
            "1.1除非另外有规定，本网站内发布的全部内容（包括但不限于，文字、图表、标识、图标按钮、图像、声音文件片段、音像文件片段、数字下载、数据编辑和软件，以下称为“本网站内容”）可供自由浏览，但除非有本公司事先书面同意，禁止任何方式、任何目的使用（包括复制、发表、更改、公众传播、再次使用以及转发等）。",
            "1.2请注意，未经权利人书面许可使用本网站内容将可能违反著作权法与商标法，也可能构成侵犯肖像权和隐私权等，相关权利人将保留追究法律责任的权利。"
          ]
        },
        {
          title: "2、 著作权及其他权利的声明",
          p1: [
            "2.1本网站所刊登的资料信息（诸如文字、图表、标识、图标按钮、图像、声音文件片段、音像文件片段、数字下载、数据编辑和软件），均是啦普哆母婴用品（上海）有限公司及其关联公司的财产，受中国和国际版权法的保护。",
            "2.2本网站上所有内容的汇编是啦普哆母婴用品（上海）有限公司及其关联公司的排他财产，受中国和国际版权法的保护。 ",
            "2.3本网站上所有软件都是啦普哆母婴用品（上海）有限公司或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。"
          ]
        },
        {
          title: "3、 商标权等的使用及声明",
          p1: [
            "3.1本网站发布的全部公司名称、商标、LOGO（以下统称为“商标权等”），皆为啦普哆母婴用品（上海）有限公司及其关联公司所有或基于合法的商标许可使用。",
            "3.2浏览或登录本网站，不意味着取得使用商标权等的许可。 ",
            "3.3除非有商标权等的权利人事先书面同意或本使用条款中明确允许的使用，严禁对本网站发布的商标权等及其他内容的不当使用。"
          ]
        },
        {
          title: "4、 链接第三方网站",
          p1: [
            "4.1本网站并不拥有或管理自本网站或本网站链接至其他第三方网站（以下称为“链接网站”）的内容的权利。",
            "4.2尽管本网站链接至链接网站，本网站不对对链接网站的内容进行任何明示、默示的保证， ",
            "4.3本网站不对您使用链接网站遭受的损害承担责任。"
          ]
        },
        {
          title: "5、 网站信息 ",
          p1: [
            '5.1除非另有明确的书面说明,本网站提供给您的全部信息、内容、材料、产品（包括软件）和服务，均是在"按现状"和"按现有"的基础上提供的。',
            "5.2本网站上的商品信息、型号、描述、活动介绍、销售点等信息随时都有可能发生变动，本网站不作特别通知。",
            "5.2由于网站上商品信息的数量极其庞大，虽然本站会尽最大努力保证您所浏览信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，本站网页显示的信息可能会有一定的滞后性或差错，对此情形您知悉并理解。",
            "5.3本网站不对其在网站上的信息、内容、材料、商品（包括软件）或服务做任何形式的、明示或者模式的保证。 "
          ]
        },
        {
          title: "6、 免责条款 ",
          p1: [
            "6.1本网站不担保本网站所包含的或以其它方式通过网站提供给您的全部信息、内容、材料、产品(包括软件)和服务、其服务器或从本网站系统发出的电子邮件、信息没有病毒或其他有害成分。"
          ]
        },
        {
          title: "7、 个人信息保护 ",
          p1: [
            "7.1 当你浏览、使用本网站时，服务器将会以匿名的形式自动记录一些信息，例如您对本网站的使用情况、IP地址、所访问服务的URL、浏览器的类型和使用的语言以及访问日期和时间等。",
            "7.2本网站会以高度的勤勉义务对待这些信息，除非事先获得您的授权或本声明另有规定外，不会将这些信息对外公开或向第三方提供（啦普哆母婴用品（上海）有限公司及其关联公司除外）。 ",
            "7.3在如下情况下，本网站可能会披露您的信息：（1）事先获得您的授权；（2）根据法律、法规、法律程序的要求或政府主管部门的强制性要求；（3）为维护本网站的合法权益，例如查找、预防、处理欺诈或安全方面的问题；（4）符合相关法律法规规定其他情形。",
            "7.4若您是18周岁以下的未成年人，在浏览、使用或登录本网站时，应事先取得您的家长或法定监护人的同意。"
          ]
        },
        {
          title: "8、 准据法及管辖权 ",
          p1: [
            "8.1本网站及本条款的使用、执行、解释及争议的解决均适用在中华人民共和国的现行有效的法律法规（但不包括其冲突法规则）。",
            "8.2如就本网站的使用、本条款的执行、解释等相关而发生任何争议时，应尽可能友好协商解决；协商不成时，纠纷中的任何一方均可向啦普哆母婴用品（上海）有限公司所在地有管辖权的人民法院提起诉讼。"
          ]
        },
        {
          title: "9、 安全性条款 ",
          p1: [
            "9.1根据国家法律法规变化及网站运营需要，本网站有权对本条款不时进行修改，修改后的条款一经发布后即刻生效。您可在本网站随时查阅最新的本条款。您若不同意更新后的本条款，则请勿继续使用、浏览本网站。"
          ]
        }
      ]
    };
  },
  components: {
    Footer
  },
  mounted() {
    this.$router.afterEach((to, from, next) => {
      window.scrollTo(0, 0);
    });
  }
};
</script>

<style lang="scss" scoped>
.top-header {
  height: 100px;
  width: 100%;
}

.content {
  width: 1200px;
  margin: 0 auto;
  h3 {
    font: 20px/50px "";
    font-weight: 600;
  }
  .text {
    font-size: 16px;
    .p1 {
      margin: 15px 0 15px 0;
    }
    article {
      margin-top: 90px;
      .title {
        font-weight: bold;
      }
    }
    .p2 {
      margin: 100px 0 0 0;
    }
    .p3 {
      margin: 30px 0 150px 0;
    }
  }
}
</style>


